//HERC01XX JOB (BANCARIO),'COMPILA BANCARIO',CLASS=A,MSGCLASS=X,      
//             REGION=8M,TIME=1440,MSGLEVEL=(1,1),NOTIFY=HERC01       
//COMPILA  EXEC COBOL,                                                
//         PROG='BANCARIO',                                           
//         BIBF='HERC01.PRIVLIB.SOURCE',                              
//         BIBC='HERC01.PRIVLIB.LOAD'                                 
//                                                                    